Tekla.Structures.ModelInternal.dotLoadGroup_t
Serialization structure for the LoadGroup.

Tekla.Structures.ModelInternal.dotLoadGroup_t.ModelObject
Base class that also contains the Identifier for this object.

Tekla.Structures.ModelInternal.dotLoadGroup_t.GroupName
Load group name, maximum length 126 characters.

Tekla.Structures.ModelInternal.dotLoadGroup_t.GroupType
Load group type

Tekla.Structures.ModelInternal.dotLoadGroup_t.Direction
Direction of the load.

Tekla.Structures.ModelInternal.dotLoadGroup_t.Compatible
Identifies groups that are compatible, i.e. may be combined
with this one during structural analysis phase. All groups
that have the same Compatible tag are considered to be
compatible with each other.

Tekla.Structures.ModelInternal.dotLoadGroup_t.Incompatible
Groups with which this group is incompatible, i.e. which cannot
be combined with each other during structural analysis phase.
All groups that have the same Incompatible tag are considered to be
incompatible with each other.

Tekla.Structures.ModelInternal.dotLoadGroup_t.Color
Color with which all Loads that belong to this group are drawn in the Tekla Structures view.